rapport.tex
% Created 2017-07-27 Thu 17:07
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{stmaryrd}
\usepackage{geometry}
\usepackage{biblatex}
\usepackage[french, english]{babel}
\bibliography{rapport}
\author{Lionel Zoubritzky}
\date{\today}
\title{Conception et implémentation d'une machine abstraite pour HOcore}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.2.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\newcommand{\send}[2]{\bar{#1}\left\langle #2\right\rangle}
\newcommand{\get}[2]{#1.\left( #2\right)}
\newcommand{\prog}[1]{\left\{ \begin{array}{l}#1\end{array} \right\}}
\newcommand{\block}[1]{\left[#1\right]}
\renewcommand{\empty}{\left[\,\right]}
\newcommand{\paren}[1]{\left(#1\right)}
\newcommand{\abs}[1]{\left|#1\right|}
\newcommand{\len}{\text{len}}
\newcommand{\env}{\text{env}}
\newcommand{\size}{\text{size}}
\newcommand{\level}{\text{Level}}
\newcommand{\machine}[1]{\left\llbracket{#1}\right\rrbracket_{\mathcal{M}}}
\newcommand{\new}[1]{\left\llbracket{#1}\right\rrbracket_{\mathcal{A}}}
\newcommand{\process}[1]{\left\llbracket{#1}\right\rrbracket_{\mathcal{P}}}
\newcommand{\sizeof}[1]{\text{size}\left(#1\right)}
\newcounter{c_theo}
\newcounter{c_def}
\newcommand{\definition}{\refstepcounter{c_def}
\textbf{Definition \arabic{c_def}.} }
\newcommand{\theorem}{\refstepcounter{c_theo}
\textbf{Theorem \arabic{c_theo}.} }
\newcommand{\lemma}{\refstepcounter{c_theo}
\textbf{Lemma \arabic{c_theo}.} }
\newcommand{\corollary}{\refstepcounter{c_theo}
\textbf{Corollary \arabic{c_theo}.} }
\newcommand{\proof}{\textbf{\\Proof of \arabic{c_theo}.} }
\newcommand{\transmit}[1]{\overset{#1}\longrightarrow}
\newcommand{\transmitb}[1]{\overset{\left(\overline{#1}\right)}\longrightarrow}
\newcommand{\transmitn}[1]{\overset{\overline{#1}+}\longrightarrow}
\newcommand{\transit}[1]{\overset{#1}\rightarrow}
\newcommand{\io}{\sim_{\texttt{IO}}^\circ}
\newcommand{\bisim}{\approx_m}
\newcommand{\stateA}[1]{\left(#1\right)_{\mathcal{A}}}

\section{Introduction 1}
\label{sec-1}
Machine abstraite : concept vague (de l'interpréteur à l'architecture),
ajout d'une mémoire par l'environnement, exécution pas à pas. Globalement:
modélisation de la sémantique (à définir). (cite Wikipedia) ou autre
Calcul de processus : parallélisme / concurrence.


\section{{\bfseries\sffamily TODO} HOcore 3}
\label{sec-2}
\subsection{{\bfseries\sffamily TODO} Définition 1}
\label{sec-2-1}
\subsubsection{{\bfseries\sffamily TODO} Syntaxe 0.6}
\label{sec-2-1-1}
\subsubsection{{\bfseries\sffamily TODO} Réduction 0.4}
\label{sec-2-1-2}
Signification de la transmission, exemples (omega)
\subsection{{\bfseries\sffamily TODO} Comparaison avec d'autres calculs 2}
\label{sec-2-2}
\subsubsection{{\bfseries\sffamily TODO} $\lambda$-calcul 1}
\label{sec-2-2-1}
Déterminisme, confluence
\subsubsection{{\bfseries\sffamily TODO} HO$\pi$ 1}
\label{sec-2-2-2}
Ordre supérieur, restriction de nom


\section{{\bfseries\sffamily TODO} Machine abstraite 5.5}
\label{sec-3}
\subsection{{\bfseries\sffamily TODO} De la machine de Krivine à HOcore 1.5}
\label{sec-3-1}
\subsubsection{{\bfseries\sffamily TODO} Machine de Krivine 0.2}
\label{sec-3-1-1}
Déterministe, stratégie d'évaluation fixée. Généralisable
\subsubsection{{\bfseries\sffamily TODO} Machine abstraite pour HOcore 0.6}
\label{sec-3-1-2}
Non-déterministe
Transition : opération élémentaire ?
\subsubsection{{\bfseries\sffamily TODO} Bonne formation 0.2}
\label{sec-3-1-3}
\subsection{{\bfseries\sffamily TODO} Correction et complétude 2}
\label{sec-3-2}
\subsubsection{{\bfseries\sffamily TODO} Traduction 0.7}
\label{sec-3-2-1}
\begin{enumerate}
\item {\bfseries\sffamily TODO} Depuis le processus vers la machine 0.2
\label{sec-3-2-1-1}
\item {\bfseries\sffamily TODO} Depuis la machine vers le processus 0.5
\label{sec-3-2-1-2}
\end{enumerate}
\subsubsection{{\bfseries\sffamily TODO} Propriétés requises 0.3}
\label{sec-3-2-2}
Deux diagrammes: correction et complétude. Ouvrir sur équité ?
\subsubsection{{\bfseries\sffamily TODO} Résumé de la preuve 1}
\label{sec-3-2-3}
\begin{enumerate}
\item {\bfseries\sffamily TODO} Préservation de la bonne formation 0.2
\label{sec-3-2-3-1}
\item {\bfseries\sffamily TODO} Équivalence de machines 0.3
\label{sec-3-2-3-2}
\item {\bfseries\sffamily TODO} Lemme principal 0.3
\label{sec-3-2-3-3}
\item De la correction à la complétude 0.2
\label{sec-3-2-3-4}
\end{enumerate}


\section{{\bfseries\sffamily TODO} Implémentation 3}
\label{sec-4}
\subsection{{\bfseries\sffamily TODO} En OCaml 1.5}
\label{sec-4-1}
\subsubsection{{\bfseries\sffamily TODO} Interpréteur 1}
\label{sec-4-1-1}
Toutes les réductions / pas-à-pas.
Problème d'optimisation.
\begin{enumerate}
\item {\bfseries\sffamily TODO} Version naïve 0.2
\label{sec-4-1-1-1}
\item {\bfseries\sffamily TODO} Regroupement par canal 0.2
\label{sec-4-1-1-2}
\item {\bfseries\sffamily TODO} Compilation vers une fonction 0.3
\label{sec-4-1-1-3}
\item {\bfseries\sffamily TODO} Structure de multi-ensemble 0.3
\label{sec-4-1-1-4}
\end{enumerate}
\subsubsection{{\bfseries\sffamily TODO} Machine abstraite 0.5}
\label{sec-4-1-2}
Module mutuellement récursifs pour les environnements.
\subsection{{\bfseries\sffamily TODO} En HOcore 1.5}
\label{sec-4-2}
\subsubsection{{\bfseries\sffamily TODO} Motivations 0.5}
\label{sec-4-2-1}
Expressivité du langage.
Compréhension de HOcore et de la machine.
\subsubsection{{\bfseries\sffamily TODO} Éléments de programmation 1}
\label{sec-4-2-2}
\begin{enumerate}
\item {\bfseries\sffamily TODO} Nombres entiers 0.3
\label{sec-4-2-2-1}
\item {\bfseries\sffamily TODO} Listes 0.2
\label{sec-4-2-2-2}
\item {\bfseries\sffamily TODO} Booléens 0.2
\label{sec-4-2-2-3}
\item {\bfseries\sffamily TODO} Boucles 0.3
\label{sec-4-2-2-4}
\end{enumerate}


\section{{\bfseries\sffamily TODO} Mise en perspective et conclusion 1.5 (dont biblio)}
\label{sec-5}
Formalisation Coq : preuves très détaillées.
Bisimulation : difficultés.
Premier pas vers HOpi (ajout de restriction de noms), puis ajout de localités.
Intérêt : rédaction de preuve, découverte de la concurrence.

\printbibliography
% Emacs 25.2.1 (Org mode 8.2.10)
\end{document}
